Q1.` List any five functions of the pandas library with execution.`

- **read_csv()** - Used to read data from a CSV file into a Pandas DataFrame.

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- **head()** - Displays the first n rows of a DataFrame (default n=5).

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- **Series** - Series will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file

In [3]:
import pandas as pd 
s = pd.Series(['pwskill','neuroAI','anonymous'],index = ['a','b','c'])
s

a      pwskill
b      neuroAI
c    anonymous
dtype: object

- **DataFrame** - A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

In [4]:
l = [{'Name':'Vikash Bharti','Company Name':'Google','Reg no':363},
     {'Name':'Abdul Razique','Company Name':'Google','Reg no':441},
     {'Name':'Nitish Raj','Company Name':'Google','Reg no':452}
    ]

In [5]:
df = pd.DataFrame(l)

In [6]:
df

            Name Company Name  Reg no
0  Vikash Bharti       Google     363
1  Abdul Razique       Google     441
2     Nitish Raj       Google     452

- **date_range()** - pd.date_range() is one of the general functions in Pandas which is used to return a fixed frequency DatetimeIndex.

In [7]:
date = pd.date_range(start = '2023-09-23', end ='2023-10-23')

In [8]:
date

DatetimeIndex(['2023-09-23', '2023-09-24', '2023-09-25', '2023-09-26',
               '2023-09-27', '2023-09-28', '2023-09-29', '2023-09-30',
               '2023-10-01', '2023-10-02', '2023-10-03', '2023-10-04',
               '2023-10-05', '2023-10-06', '2023-10-07', '2023-10-08',
               '2023-10-09', '2023-10-10', '2023-10-11', '2023-10-12',
               '2023-10-13', '2023-10-14', '2023-10-15', '2023-10-16',
               '2023-10-17', '2023-10-18', '2023-10-19', '2023-10-20',
               '2023-10-21', '2023-10-22', '2023-10-23'],
              dtype='datetime64[ns]', freq='D')

Q2.` Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.`

In [9]:
def re_index(df):
    new_index = range(1, 2*len(df)+1,2)
    df.index = new_index
    return df

In [10]:
df = pd.DataFrame({'a':[10,20,30], 'b':[40,50,60], 'c':[70,80,90]})
re_index(df)

    a   b   c
1  10  40  70
3  20  50  80
5  30  60  90

Q3.` You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.`


- **For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.**

In [11]:
def cal_frist_three_sum(df):
    if 'Values' not in df.columns:
        return
    first_three_sum = df['Values'].head(3).sum()
    print(first_three_sum)

In [12]:
df = pd.DataFrame({'Values':[10, 20, 30, 40, 50]})
cal_frist_three_sum(df)

60

Q4. `Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.`

In [13]:
def word_count(df):
    if 'Text' in df.columns:
        df['Word_Count'] = df['Text'].apply(lambda x:len(x.split()))
        return df
    
    print('invalid index')

    
    
    
    
df = pd.DataFrame({'Text':['This free course on machine learning is designed to provide beginners with a comprehensive introduction to the fundamental concepts and techniques used in this exciting field. The course covers topics such as supervised and unsupervised learning, linear regression, decision trees, and clustering. Through a combination of video lectures, interactive exercises, and real-world examples, students will gain a solid understanding of the principles of machine learning and how they can be applied to solve complex problems. ']})        
word_count(df)
df

                                                Text  Word_Count
0  This free course on machine learning is design...          75

Q5`. How are DataFrame.size() and DataFrame.shape() different?`

In Pandas, `DataFrame.size` and `DataFrame.shape` are two different attributes that provide different information about a DataFrame:

1.`DataFrame.size`:
- **DataFrame.size**  returns the total number of elements in the DataFrame, which is calculated as the product of the number of rows and the number of columns.
- It represents the total number of data points in the DataFrame, including all the individual cells or elements.
- The result is a single integer representing the size of the DataFrame.

In [18]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df1 = pd.DataFrame(data)
df1.size

6


2. `DataFrame.shape`:
   -**DataFrame.shape** returns a tuple that represents the dimensions of the DataFrame, with the first element being the number of rows and the second element being the number of columns.
   - It provides information about the structure of the DataFrame in terms of its rows and columns.
   - The result is a tuple (n_rows, n_columns) representing the shape of the DataFrame.
In summary, `DataFrame.size` gives you the total number of elements in the DataFrame, while `DataFrame.shape` provides information about the number of rows and columns in the DataFrame as a tuple.

In [20]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df1 = pd.DataFrame(data)
df1.shape

(3, 2)

Q6.` Which function of pandas do we use to read an excel file?`

To read an Excel file in Pandas, you can use the `pandas.read_excel()` function. This function allows you to read data from an Excel file and create a Pandas DataFrame :

```python

# Read an Excel file and create a DataFrame
df = pd.read_excel('your_excel_file.xlsx')

# Now, 'df' contains the data from the Excel file
```

In the code above, replace `'your_excel_file.xlsx'` with the path to the Excel file you want to read. The `read_excel()` function can read both `.xls` and `.xlsx` file formats. Additionally, it provides various options and parameters to customize how the data is read, such as specifying the sheet name, skipping rows, and more.

Q7. `You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.The username is the part of the email address that appears before the '@' symbol`
- **For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username'column**

In [39]:
def extract_username_from_email(df):
    if 'Email' not in df.columns:
        return
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

In [40]:
df = pd.DataFrame({'Email':['raadhakrishna@gmail.com','bvikash@gmail.com','abdulrazique@gmail.com']})

In [41]:
df
extract_username_from_email(df)

                     Email       Username
0  raadhakrishna@gmail.com  raadhakrishna
1        bvikash@gmail.com        bvikash
2   abdulrazique@gmail.com   abdulrazique

Q8. `You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects. all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.`
- For example, if df contains the following values:
- idx  A B C
- 0  3  5  1
- 1 8 2 7
- 2 6 9 4
- 3 2 3 5
- 4 9 1 2

In [43]:
def select_rows(df):
    if 'A' not in df.columns or 'B' not in df.columns:
        print("Columns 'A' and 'B' are required and do not exist in the DataFrame.")
        return
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]

    return selected_rows

In [44]:
data = {'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)

selected_df = select_rows(df)
selected_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2